Revit 2024 API
AnalysisDisplayVectorSettings Methods
The AnalysisDisplayVectorSettings type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Compares two vector settings objects.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace